[{
    "author": "Daniel Libeskind",
    "imageLink": "https://i.ibb.co/27PDxhy/1.png",
    "title": "ARCHITECTURAL MEDITATIONS",
    "price": 200,
    "description": "Chamber Works is one of a number of suites of drawings and prints created by Daniel Libeskind during his tenure as CAA architect-in-residence from 1978-1985. These works took the architectural community by storm in the early 1980s."
  },
    {
      "author": "MICHAËL BORREMANS",
      "imageLink": "https://i.ibb.co/N96bG39/2.png",
      "title": "MICHAËL BORREMANS PAINTINGS",
      "price": 200,
      "description": "Color plates of Borremans paintings accompanied by an essay penned by curator Jeffrey Grove."
    },
    {
      "author": "CAFETERIA",
      "imageLink": "https://i.ibb.co/bbcndtx/3.png",
      "title": "CAFETERIA - A MAGAZINE OF POETRY NO.8",
      "price": 14,
      "description": "Cafeteria: a magazine of poetry. Published 'at least' annually. The journal was formed by San Diego State University creative writing department poets after their sessions in the school cafeteria (hence the title) led to the magazine which printed many local poets and included original graphic work."
    },
    {
      "author": "GARY SNYDER",
      "imageLink": "https://i.ibb.co/zf51qPV/4.png",
      "title": "GOOD WILD SACRED BY GARY SNYDER",
      "price": 60,
      "description": "Originally appeared in The CoEvolution Quarterly, 1983, this is the first version published in book form, with delicate hand-threaded binding. "
    },
    {
      "author": "CURTIS BRADFORD",
      "imageLink": "https://i.ibb.co/NTyZHcJ/5.png",
      "title": "YEATS AT WORK BY ",
      "price": 32,
      "description": "For the centennial of William Butler Yeats birth, published is a collection of newly transcribed archived work. Yeats left behind a huge amount of incredibly difficult and almost illegible array of pre-published manuscripts. From this rich abundance of unpublished papers from Yeats possessions, Curtis Bradford took on the Herculean task of collecting, transcribing and editing said work for scholars and readers of Yeats to enjoy."
    },
    {
      "author": "STEVEN CONKLE AND GARY SNYDER",
      "imageLink": " https://i.ibb.co/YTTBbNd/6.png",
      "title": "TREE ZEN",
      "price": 28,
      "description": "Columbus: The Broken Stone. 1984. Edition of 1500. Soft Cover. Book Condition: Fine, light toning at spine. Unpaginated."
    },
    {
      "author": "JOHN LANE",
      "imageLink": "https://i.ibb.co/YpD3CSy/7.png",
      "title": "THIN CREEK - A POEM BY JOHN LANE",
      "price": 25,
      "description": "Port Townsend. Copper Head Canyon Press. 1978, Edition of 250. Softcover chapbook w/ letter-pressed cover on Ragston paper. Book Condition: Fine. Unpaginated. Color Illus. by Barbara Arnold."
    },
    {
      "author": "AGENDA",
      "imageLink": "https://i.ibb.co/qC9qZ5r/8.png",
      "title": "AGENDA: ENGLISH POETRY NOW",
      "price": 38,
      "description": "London. Agenda Editions. Vol. 4 No. 1 April-May 1965. Softcover staple bound chapbook. Book Condition: Fine, minor shelf wear. 63pp."
    },
    {
      "author": "DAVID IRELAND",
      "imageLink": "https://i.ibb.co/nkbd0RW/9.png",
      "title": "DAVID IRELAND - THE ARTS CLUB CHICAGO",
      "price": 26,
      "description": "Chicago. The Arts Club of Chicago. Congress Printing Company. 1996.  Softcover with with art paper cover. Book Condition: Fine, clean text pages, minor shelf wear. 27pp. Color and B/W Illus."
    }
  ]
